app/Entities/User.php

    public function getLinkProfile(): object|array|null
    {

        if ( is_null($this->attributes['id_profile']) ) return [];

        $profileModel = new ProfilesModel();
        return $profileModel->find($this->attributes['id_profile']);
---
SELECT *
FROM `profiles`
WHERE `profiles`.`id` = '2'