app/Controllers/Users.php

    public function get(int $id): ResponseInterface
    {
        $userModel = new UsersModel();
        $user = $userModel->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 2

    public function create(): ResponseInterface
    {

        $post = get_object_vars($this->request->getJSON());

        $UsersModel = new UsersModel();
        $userEntity = new User();
        $userEntity->fill($post)->setProfileId();

        try {
            $UsersModel->save($userEntity);
---
INSERT INTO `users` (`first_name`, `last_name`, `mail`, `phone`, `id_profile`) VALUES ('Prévost', 'Durand', NULL, '+33612345678', 2)

    public function delete(int $id): ResponseInterface
    {
        $userModel = new UsersModel();
        $userModel->delete($id);
---
DELETE FROM `users`
WHERE `id` IN (1)

    public function update(int $id): ResponseInterface
    {
        $post = get_object_vars($this->request->getJSON());

        $UsersModel = new UsersModel();
        $user = $UsersModel->find($id);

        $user->fill($post)->setProfileId();

        try {
            $UsersModel->save($user);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 2
INSERT INTO `users` (`first_name`, `last_name`, `mail`, `phone`, `id_profile`) VALUES ('Prévosts', 'Durand', 'prevost@company.com', '+33612345678', 1)
UPDATE `users` SET `id_profile` = 1, `mail` = 'prevostss@company.com', `first_name` = 'Prévosts'
WHERE `users`.`id` IN ('2')